# SimpleLine Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarShape..::..SimpleLine Property
RebarShape Class See Also
---
Check whether this shape consists of a single straight segment, possibly with hooks.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2009
# Syntax
C#
---
```text
public bool SimpleLine { get; }
```

Visual Basic
---
```text
Public ReadOnly Property SimpleLine As Boolean
	Get
```

Visual C++
---
```text
public:
property bool SimpleLine {
	bool get ();
}
```

# See Also
RebarShape Class
Autodesk.Revit.DB.Structure Namespace